package org.knock.knock_back.dto.dictionary;

/**
 * @author nks
 * @apiNote 닉네임 자동 생성을 위한 형용사, 동물이름 사전
 */
public class Dictionary {

    public String[] adjective = new String[]
    {
        "친절한", "활발한", "사교적인", "용감한", "성실한", "신중한", "책임감 있는",
        "낙천적인", "조용한", "정직한", "예의 바른", "온화한", "따뜻한", "솔직한",
        "창의적인", "도전적인", "열정적인", "겸손한", "참을성 있는", "근면한",
        "꼼꼼한", "배려심 깊은", "긍정적인", "유머러스한", "결단력 있는",
        "이해심 있는", "공감하는", "책임감 있는", "자신감 있는", "의지력이 강한",
        "정이 많은", "순수한", "낭만적인", "체계적인", "분석적인", "독립적인",
        "호기심 많은", "공정한", "논리적인", "열린 마음의", "활기찬", "부드러운",
        "융통성 있는", "자기주장이 강한", "모험적인", "평온한", "유연한",
        "정열적인", "냉철한", "자상한", "현명한", "이타적인", "용의주도한",
        "충성스러운", "겉치레 없는", "독창적인", "수용적인", "낯가림 없는",
        "목표 지향적인", "현실적인", "단순한", "강단 있는", "낙관적인",
        "실용적인", "자발적인", "끈기 있는", "냉정한", "사려 깊은", "유능한",
        "주도적인", "배짱 있는", "공손한", "생각이 깊은", "진취적인", "외향적인",
        "내성적인", "고집 센", "열려 있는", "포용력 있는", "섬세한",
        "호의적인", "인내심 있는", "결단력 있는", "헌신적인", "분별력 있는",
        "말수가 적은", "조화로운", "활달한", "정중한", "근엄한", "유연한",
        "속 깊은", "직설적인", "끊임없는", "미소 짓는", "독특한",
        "풍부한 상상력의", "인상 깊은", "신뢰할 수 있는", "공감력이 강한",
        "능동적인", "유려한", "차분한", "정서적인", "매력적인",
        "변덕스러운", "단단한", "체계적인", "책임감이 강한", "성공 지향적인",
        "쾌활한", "똑똑한", "신속한", "깊이 있는", "전문적인",
        "분투하는", "중립적인", "탐구적인", "도움이 되는", "겉보기와 다른",
        "가정적인", "협조적인", "실험적인", "끈질긴", "효율적인",
        "우아한", "천진난만한", "거침없는", "지혜로운", "현실감 있는",
        "집중력 있는", "융합적인", "자유로운", "결단력이 강한", "온화한",
        "심오한", "겉과 속이 다른", "개방적인", "분명한", "낙천주의적인",
        "의심 많은", "용의주도한", "진중한", "낯가림이 심한", "타협적인",
        "융화적인", "자비로운", "실천적인", "의미심장한", "목적 지향적인",
        "조화로운", "낙관적인", "매력적인", "중립적인", "효율적인",
        "풍부한", "일관적인", "희생적인", "세심한", "편안한", "도전적인",
        "자제력이 강한", "풍성한", "검소한", "유망한", "정교한",
        "철저한", "공손한", "부지런한", "단호한", "사려깊은",
        "예리한", "속도감 있는", "거침없는", "자율적인", "낙천적이고 현실적인",
        "믿음직스러운", "실천력이 뛰어난", "생각이 깊은", "다정한", "활동적인",
        "순응적인", "비판적인", "통찰력 있는", "신비로운", "감정적인",
        "냉철하면서도 따뜻한", "강인한", "끊임없는", "낯선 것을 두려워하지 않는",
        "혁신적인", "학구적인", "깊이 있는", "진지한", "열정적인",
        "결연한", "평온하면서도 단호한", "자립적인", "직관적인", "풍요로운",
        "지적인", "강렬한", "명확한", "조심스러운", "희망적인"
    };

    public String[] animal = new String[]
    {
        "개", "고양이", "사자", "호랑이", "코끼리", "기린", "치타", "늑대",
        "여우", "곰", "판다", "캥거루", "하마", "코뿔소", "원숭이", "침팬지",
        "고릴라", "말", "돼지", "소", "양", "염소", "닭", "오리", "거위",
        "칠면조", "백조", "펭귄", "독수리", "매", "올빼미", "까마귀", "참새",
        "비둘기", "앵무새", "갈매기", "플라밍고", "두루미", "쥐", "햄스터",
        "토끼", "다람쥐", "고슴도치", "너구리", "스컹크", "미어캣", "두더지",
        "박쥐", "아르마딜로", "고래", "돌고래", "상어", "바다사자", "물개",
        "해달", "바다거북", "해마", "불가사리", "해파리", "말미잘", "산호",
        "가오리", "오징어", "문어", "새우", "게", "랍스터", "가재",
        "청개구리", "도롱뇽", "맹꽁이", "뱀", "도마뱀", "악어", "카멜레온",
        "이구아나", "거북이", "타조", "에뮤", "키위새", "알파카", "라마",
        "딱따구리", "벌새", "백조", "두더지쥐", "두꺼비", "개구리", "잉어",
        "송어", "연어", "고등어", "참치", "명태", "멸치", "정어리", "청새치",
        "돌고래", "흰수염고래", "범고래", "쥐치", "붕어", "오리너구리", "비버",
        "표범", "재규어", "퓨마", "스라소니", "카리부", "순록", "들소", "물소",
        "코요테", "재규어", "라쿤", "너구리", "담비", "족제비", "해리어",
        "알바트로스", "콘도르", "이집트기러기", "물총새", "왜가리", "가마우지",
        "도요새", "까치", "까마귀", "개미핥기", "천산갑", "판골린", "코알라",
        "왈라비", "청설모", "날다람쥐", "고라니", "노루", "사슴", "엘크",
        "무스", "뿔소라", "거미", "타란툴라", "전갈", "바퀴벌레", "파리",
        "모기", "개미", "꿀벌", "말벌", "장수풍뎅이", "사슴벌레", "무당벌레",
        "잠자리", "메뚜기", "여치", "귀뚜라미", "나비", "나방", "하루살이",
        "산호초물고기", "해양가오리", "노랑초롱아귀", "복어", "바다뱀",
        "피라냐", "악어거북", "카이만", "가비알", "발톱도마뱀", "리자드",
        "버마비단뱀", "왕코브라", "방울뱀", "모니터도마뱀", "날치",
        "귀상어", "톱상어", "큰입베스", "황새", "홍학", "왜가리", "큰까마귀",
        "황조롱이", "수달", "족제비", "미어캣", "고양잇과동물", "코요테",
        "아나콘다", "보아", "왕도마뱀", "초롱아귀", "쥐치", "갈치", "붕어",
        "테트라", "시클리드", "아로와나", "구피", "비단잉어", "새우", "가재",
        "갑오징어", "문어", "오징어", "홀치기", "불가사리", "말미잘", "해삼",
        "달팽이", "민달팽이", "굴", "전복", "조개", "개복치", "청새치",
        "황새치", "멍게", "해파리", "오리너구리", "유대하늘소", "코모도도마뱀",
        "공작", "앵무새", "왜가리", "솔개", "수리부엉이", "박새", "딱따구리",
        "흰올빼미", "홍학", "카사와리", "에뮤", "아르마딜로", "산양", "빨판상어",
        "민물가재", "미꾸라지", "장어", "펭귄", "북극곰", "바다표범", "물범",
        "돌고래", "고래상어", "범고래", "큰돌고래", "가오리", "바다악어",
        "바다코끼리", "바다사자", "오징어", "대왕오징어", "흰수염고래",
        "작은발톱수달", "아프리카코끼리", "아시아코끼리", "해태", "드래곤",
        "히드라", "유니콘", "그리핀", "페가수스", "스핑크스"
    };


}
